// 共通页面
export const COMMON_VARS = {
    HTTP_ERROR : '网络连接失败, 请稍后再试',
};


// HTTP
const BASE_VERSION = '/v1';
export const HTTP_URL = {
    CODE_URL: '/util/code/',
    LOGIN: `${BASE_VERSION}/star/login`,
    STAR_LIST: `${BASE_VERSION}/star/list`,
    STAR_PUSH: `${BASE_VERSION}/star/push/`
};

// DEFAULE
export const DEFAULT = {
    CODE_PIC: 'http://i3.letvimg.com/lc03_iscms/201508/18/16/41/b11f8f66bef842caabdb5da35660f48f.png',
};

// Message
export const MESSAGE = {
    USER_NAME_NOT_EMPTY: '用户名不能为空',
    PASSWORD_NOT_EMPTY: '密码不能为空',
};

export const AREAS = {
    50001:	'中国大陆',
    50002:	'香港',
    50003:	'台湾',
    50004:	'马来西亚',
    50005:	'新加坡',
    52002:	'华语其他',
    50041:	'日本',
    50042:	'韩国',
    50071:	'美国',
    50072:	'英国',
    50073:	'加拿大',
    50074:	'西班牙',
    50075:	'法国',
    50076:	'德国',
    50077:	'挪威',
    50078:	'意大利',
    50079:	'澳大利亚',
    50151:	'欧美其他',
    50338:	'墨西哥',
    50355:	'北欧',
    50100:	'其他',
    50101:	'泰国',
    50102:	'俄罗斯',
    50103:	'印度',
    50104:	'东南亚',
    52003:	'亚洲其他',
    52004:	'非洲',
    52005:	'拉丁美洲',
    52006:	'澳洲',
};

export const PROFESSIONALS = {
    465001:	'演员',
    465002:	'导演',
    465003:	'主持人',
    465004:	'歌手',
    465005:	'编剧',
    465006:	'摄像',
    465007:	'制片人',
    465008:	'讲师',
    465009:	'足球',
    465010:	'篮球',
    465011:	'网球',
    465012:	'台球',
    465013:	'兵乓球',
    465014:	'羽毛球',
    465015:	'田径',
    465016:	'排球',
    465017:	'体操',
    465018:	'游泳',
    465019:	'射击',
    465020:	'举重',
    465021:	'综合其他',
    465022:	'原作',
    465023:	'监督',
    465024:	'声优',
    465025:	'摄影师',
    465026:	'设计师',
    465027:	'艺术家',
};

export const GENDERS = {
    0: '乐队/组合',
    1: '男',
    2: '女',
    4: '未知',
};


